load_testing/output/observations_n1c1.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient).....done


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/observations
Document Length:        854 bytes

Concurrency Level:      1
Time taken for tests:   0.655 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      1210 bytes
Total body sent:        2204
HTML transferred:       854 bytes
Requests per second:    1.53 [#/sec] (mean)
Time per request:       654.535 [ms] (mean)
Time per request:       654.535 [ms] (mean, across all concurrent requests)
Transfer rate:          1.81 [Kbytes/sec] received
                        3.29 kb/s sent
                        5.09 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       59   59   0.0     59      59
Processing:   595  595   0.0    595     595
Waiting:      592  592   0.0    592     592
Total:        654  654   0.0    654     654