load_testing/output/observations_n60c10_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient).....done


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/observations
Document Length:        1000 bytes

Concurrency Level:      10
Time taken for tests:   5.322 seconds
Complete requests:      60
Failed requests:        0
Non-2xx responses:      60
Total transferred:      70920 bytes
Total body sent:        132240
HTML transferred:       60000 bytes
Requests per second:    11.27 [#/sec] (mean)
Time per request:       886.963 [ms] (mean)
Time per request:       88.696 [ms] (mean, across all concurrent requests)
Transfer rate:          13.01 [Kbytes/sec] received
                        24.27 kb/s sent
                        37.28 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       48  380 527.1    125    2336
Processing:   178  437 373.9    289    1724
Waiting:      178  437 373.8    289    1724
Total:        253  817 551.9    492    2544

Percentage of the requests served within a certain time (ms)
  50%    492
  66%   1112
  75%   1376
  80%   1459
  90%   1513
  95%   1727
  98%   1800
  99%   2544
 100%   2544 (longest request)