load_testing/output/observations_n60c10_5.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient).....done


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/observations
Document Length:        1000 bytes

Concurrency Level:      10
Time taken for tests:   12.280 seconds
Complete requests:      60
Failed requests:        0
Non-2xx responses:      60
Total transferred:      70920 bytes
Total body sent:        132240
HTML transferred:       60000 bytes
Requests per second:    4.89 [#/sec] (mean)
Time per request:       2046.722 [ms] (mean)
Time per request:       204.672 [ms] (mean, across all concurrent requests)
Transfer rate:          5.64 [Kbytes/sec] received
                        10.52 kb/s sent
                        16.16 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      145  577 510.9    347    1530
Processing:   190  929 882.3    469    4568
Waiting:      189  928 882.4    469    4567
Total:        423 1505 1097.9    843    4979

Percentage of the requests served within a certain time (ms)
  50%    843
  66%   1766
  75%   1954
  80%   2475
  90%   3294
  95%   3500
  98%   4177
  99%   4979
 100%   4979 (longest request)