load_testing/output/sensors_n1c1.txt
This is ApacheBench, Version 2.3 <$Revision: 1554214 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 54.72.170.113 (be patient).....done


Server Software:        Apache-Coyote/1.1
Server Hostname:        54.72.170.113
Server Port:            8080

Document Path:          /webapp/sos/rest/sensors
Document Length:        890 bytes

Concurrency Level:      1
Time taken for tests:   0.511 seconds
Complete requests:      1
Failed requests:        0
Total transferred:      1210 bytes
Total body sent:        3003
HTML transferred:       890 bytes
Requests per second:    1.96 [#/sec] (mean)
Time per request:       510.607 [ms] (mean)
Time per request:       510.607 [ms] (mean, across all concurrent requests)
Transfer rate:          2.31 [Kbytes/sec] received
                        5.74 kb/s sent
                        8.06 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       48   48   0.0     48      48
Processing:   463  463   0.0    463     463
Waiting:      462  462   0.0    462     462
Total:        511  511   0.0    511     511